Revit 2026 API
AssetProperty.GetSingleConnectedAsset Method
 Gets the single connected asset attached to this asset property, if it exists.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Asset GetSingleConnectedAsset()
Public Function GetSingleConnectedAsset As Asset
public:
Asset^ GetSingleConnectedAsset()
member GetSingleConnectedAsset : unit -> Asset
Return Value
Asset
 The connected asset, or null if there is no connected asset.
Exceptions
Exception | Condition
InvalidOperationException |  Asset is connected to more than one asset.
Remarks
 Throws if there is more than one connected asset.
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace